Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: Windows Python is built in Microsoft Visual C++; using other compilers may or may not work (though Borland seems to). The rest of this section is MSVC++ specific.
pl: Język pytonowski w Windows jest zbudowany w Microsoft Visual C++; użycie innych kompilatorów może lub może nie działać (chociaż Borland wydaje się). Reszta tego rozdziału jest szczególna dla MSVC++.

source: When creating DLLs in Windows, you must pass :file:`pythonXY.lib` to the linker. To build two DLLs, spam and ni (which uses C functions found in spam), you could use these commands::
pl: Gdy tworzymy pliki DLL w Windows, trzeba przekazać plik :file:`pythonXY.lib` dla programu łączącego. Aby zbudować dwa DLL, spam i ni (który używa zadań C znajdujących się w spam), możesz użyć tych poleceń::

source: The first command created three files: :file:`spam.obj`, :file:`spam.dll` and :file:`spam.lib`. :file:`Spam.dll` does not contain any Python functions (such as :cfunc:`PyArg_ParseTuple`), but it does know how to find the Python code thanks to :file:`pythonXY.lib`.
pl: Pierwsze polecenie utworzyło trzy pliki: :file:`spam.obj`, :file:`spam.dll` i :file:`spam.lib`. Plik :file:`Spam.dll` nie zawiera żadnych zadań języka pytonowskiego (takich jak :cfunc:`PyArg_ParseTuple`), ale wie jak znaleźć kod języka pytonowskiego dzięki plikowi :file:`pythonXY.lib`.

source: The second command created :file:`ni.dll` (and :file:`.obj` and :file:`.lib`), which knows how to find the necessary functions from spam, and also from the Python executable.
pl: Drugie polecenie utworzyło plik :file:`ni.dll` (i pliki :file:`.obj` i :file:`.lib`), które wiedzą jak znaleźć konieczne zadania ze spamu, a także z pliku wykonywalnego języka pytonowskiego.

source: Not every identifier is exported to the lookup table. If you want any other modules (including Python) to be able to see your identifiers, you have to say ``_declspec(dllexport)``, as in ``void _declspec(dllexport) initspam(void)`` or ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.
pl: Nie każdy identyfikator jest exportowany do tabeli podglądania. Jeśli chcesz jakichkolwiek innych modułów (a także języka pytonowskiego) aby mogły widzieć twoje identyfikatory, musisz powiedzieć ``_declspec(dllexport)``, jak w ``void _declspec(dllexport) initspam(void)`` lub ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.

source: Developer Studio will throw in a lot of import libraries that you do not really need, adding about 100K to your executable. To get rid of them, use the Project Settings dialog, Link tab, to specify *ignore default libraries*. Add the correct :file:`msvcrtxx.lib` to the list of libraries.
pl: Studio Rozwoju będzie wrzucało mnóstwo bibliotek import których nie potrzebujesz tak naprawdę, dodając około 100K do twojego pliku wykonywalnego. Aby się go pozbyć, użyj okna dialogowego Ustawienia Projektu, zakładki Połączeń, aby określić *ignoruj domyślne biblioteki*. Dodaj właściwy plik :file:`msvcrtxx.lib` do listy bibliotek.
